In [1]:
# Import libraries
import pandas as pd
# Read data from the csv file
dataset = pd.read_csv(r"C:\Users\user\Downloads\siddharth\loan_small.csv")
import warnings
warnings.filterwarnings('ignore')

In [2]:
dataset.head()

,Loan_ID,Gender,ApplicantIncome,CoapplicantIncome,LoanAmount,Area,Loan_Status
0,LP001002,NaN,5849.0,0.0,NaN,urban,Y
1,LP001003,Male,4583.0,NaN,128.0,semi,N
2,LP001005,Male,3000.0,0.0,66.0,NaN,Y
3,LP001006,Female,2583.0,2358.0,120.0,semi,NaN
4,LP001008,Male,NaN,0.0,141.0,urban,Y

In [3]:
# Access the data using iloc. 
# Example - Get first three rows from the second and third column
subset = dataset.iloc[0:3, 1:3]

In [4]:
subset = dataset.iloc[0:7,3:7]
subset

   CoapplicantIncome  LoanAmount   Area Loan_Status
0                0.0         NaN  urban           Y
1                NaN       128.0   semi           N
2                0.0        66.0    NaN           Y
3             2358.0       120.0   semi         NaN
4                0.0       141.0  urban           Y
5             4196.0       267.0   semi           Y
6             1516.0         NaN  rural           Y

In [5]:
subset = dataset.iloc[1:7, [1, 4, 5, 6]]  # Using iloc for position-based selection
subset

   Gender  LoanAmount   Area Loan_Status
1    Male       128.0   semi           N
2    Male        66.0    NaN           Y
3  Female       120.0   semi         NaN
4    Male       141.0  urban           Y
5    Male       267.0   semi           Y
6    Male         NaN  rural           Y

In [6]:
subset

   Gender  LoanAmount   Area Loan_Status
1    Male       128.0   semi           N
2    Male        66.0    NaN           Y
3  Female       120.0   semi         NaN
4    Male       141.0  urban           Y
5    Male       267.0   semi           Y
6    Male         NaN  rural           Y

In [7]:
dataset.columns

Index(['Loan_ID', 'Gender', 'ApplicantIncome', 'CoapplicantIncome',
       'LoanAmount', 'Area', 'Loan_Status'],
      dtype='object')

In [8]:
value = dataset.loc[0, ['ApplicantIncome', 'CoapplicantIncome']]
print(value)

ApplicantIncome      5849.0
CoapplicantIncome       0.0
Name: 0, dtype: object

In [9]:
values = dataset.loc[:, ['ApplicantIncome', 'CoapplicantIncome']]
print(values)

    ApplicantIncome  CoapplicantIncome
0            5849.0                0.0
1            4583.0                NaN
2            3000.0                0.0
3            2583.0             2358.0
4               NaN                0.0
5            5417.0             4196.0
6            2333.0             1516.0
7            3036.0             2504.0
8            4006.0             1526.0
9           12841.0            10968.0
10           3200.0              700.0
11           2500.0             1840.0
12              NaN             8106.0
13           1853.0             2840.0
14           1299.0             1086.0
15           4950.0                0.0

In [10]:
# Access the data using column names
# Get all rows of the column Gender and ApplicantIncome
subsetN = dataset[['Gender', 'ApplicantIncome']]

In [11]:
subset2 = dataset.loc[:,['Gender', 'ApplicantIncome']]
subset2

    Gender  ApplicantIncome
0      NaN           5849.0
1     Male           4583.0
2     Male           3000.0
3   Female           2583.0
4     Male              NaN
5     Male           5417.0
6     Male           2333.0
7   Female           3036.0
8     Male           4006.0
9     Male          12841.0
10  Female           3200.0
11    Male           2500.0
12  Female              NaN
13    Male           1853.0
14    Male           1299.0
15    Male           4950.0

In [12]:
# Get first three rows of the columns Gender and ApplicantIncome
subsetN = dataset[['Gender', 'ApplicantIncome']][0:3]

In [13]:
subset2 = dataset.loc[0:2,['Gender', 'ApplicantIncome']]
subset2

  Gender  ApplicantIncome
0    NaN           5849.0
1   Male           4583.0
2   Male           3000.0

In [14]:
# display a small set of data for quick check on a large data
dataset.head(10)

,Loan_ID,Gender,ApplicantIncome,CoapplicantIncome,LoanAmount,Area,Loan_Status
0,LP001002,NaN,5849.0,0.0,NaN,urban,Y
1,LP001003,Male,4583.0,NaN,128.0,semi,N
2,LP001005,Male,3000.0,0.0,66.0,NaN,Y
3,LP001006,Female,2583.0,2358.0,120.0,semi,NaN
4,LP001008,Male,NaN,0.0,141.0,urban,Y
5,LP001011,Male,5417.0,4196.0,267.0,semi,Y
6,LP001013,Male,2333.0,1516.0,NaN,rural,Y
7,LP001014,Female,3036.0,2504.0,158.0,semi,N
8,LP001018,Male,4006.0,1526.0,168.0,rural,Y
9,LP001020,Male,12841.0,10968.0,349.0,semi,N

In [15]:
# Get the Shape of the dataframe (Row x Columns)
dataset.shape

(16, 7)

In [16]:
# Get column names of the dataframe
dataset.columns

Index(['Loan_ID', 'Gender', 'ApplicantIncome', 'CoapplicantIncome',
       'LoanAmount', 'Area', 'Loan_Status'],
      dtype='object')

In [17]:
# Store column names of the dataframe in a list
column_list = dataset.columns.to_list()

# Handling missing values

In [18]:
# Find out columns with missing values with their count
dataset.isnull().sum(axis=0)

Loan_ID              0
Gender               1
ApplicantIncome      2
CoapplicantIncome    1
LoanAmount           3
Area                 1
Loan_Status          1
dtype: int64

In [19]:
# Drop all the rows with missing values
dataset_clean = dataset.dropna()

In [20]:
# Drop all the rows with missing values of a particular column 
dataset_clean = dataset.dropna(subset=["Loan_Status"])

# Imputing Values

In [40]:
# Replace missing categorical values using column names
dt = dataset.copy()
cols = ['Gender', 'Area', 'Loan_Status']

In [42]:
# fillna for filling NaN values
dt[cols] = dt[cols].fillna(dt.mode().iloc[0])
dt.isnull().sum(axis=0)

Loan_ID              0
Gender               0
ApplicantIncome      2
CoapplicantIncome    1
LoanAmount           3
Area                 0
Loan_Status          0
dtype: int64

In [23]:
# Replace missing numerical values using column names
cols2 = ['ApplicantIncome', 'CoapplicantIncome', 'LoanAmount']

In [24]:
# fillna for filling NaN values
dt[cols2] = dt[cols2].fillna(dt.mean())
dt.isnull().sum(axis=0)

Loan_ID              0
Gender               0
ApplicantIncome      0
CoapplicantIncome    0
LoanAmount           0
Area                 0
Loan_Status          0
dtype: int64

# Label encoding - Convert Categorical to Numerical values

In [25]:
# Get datatypes of all the columns of the dataframe
dt.dtypes

Loan_ID               object
Gender                object
ApplicantIncome      float64
CoapplicantIncome    float64
LoanAmount           float64
Area                  object
Loan_Status           object
dtype: object

In [26]:
# Convert string/object column types to categorical 
dt[cols] = dt[cols].astype('category')

In [27]:
# Convert string to numerical codes
for columns in cols:
    dt[columns] = dt[columns].cat.codes

In [44]:
dt[columns]

0     Y
1     N
2     Y
3     Y
4     Y
5     Y
6     Y
7     N
8     Y
9     N
10    Y
11    Y
12    Y
13    N
14    Y
15    Y
Name: Loan_Status, dtype: object

# Hot encoding or Dummy Variable Creation

In [28]:
# Drop a column using column name
df2 = dataset.drop(['Loan_ID'], axis=1)

In [29]:
# using get_dummies function of Pandas
df2 = pd.get_dummies(df2)

In [30]:
# Avoid dummy variable trap using drop_first
df3 = dataset.drop(['Loan_ID'], axis=1)
df3 = pd.get_dummies(df3, drop_first=True)

# Data Normalization using Standardscaler and MinMax

In [31]:
# extract data to scale
data_to_scale = dataset_clean.iloc[:, 2:5]

In [32]:
# Import the StandardScaler class
from sklearn.preprocessing import StandardScaler

In [33]:
# Create an object of the class StandardScaler
scaler = StandardScaler()

In [34]:

# Fit and Transform the data for normalization
ss_scaler = scaler.fit_transform(data_to_scale)

In [35]:
# MinMax Normalization of the data
from sklearn.preprocessing import minmax_scale

In [36]:
# Fit and Transform the data for MinMax normalization
mm_scaler = minmax_scale(data_to_scale)

# Split the Data by rows and columns

In [37]:
df = dataset.copy()

In [38]:
# Split by column for X(independent) and Y(dependent) variables
X = df.iloc[:, :-1]
Y = df.iloc[:,  -1]

In [46]:
X

     Loan_ID  Gender  ApplicantIncome  CoapplicantIncome  LoanAmount   Area
0   LP001002     NaN           5849.0                0.0         NaN  urban
1   LP001003    Male           4583.0                NaN       128.0   semi
2   LP001005    Male           3000.0                0.0        66.0    NaN
3   LP001006  Female           2583.0             2358.0       120.0   semi
4   LP001008    Male              NaN                0.0       141.0  urban
5   LP001011    Male           5417.0             4196.0       267.0   semi
6   LP001013    Male           2333.0             1516.0         NaN  rural
7   LP001014  Female           3036.0             2504.0       158.0   semi
8   LP001018    Male           4006.0             1526.0       168.0  rural
9   LP001020    Male          12841.0            10968.0       349.0   semi
10  LP001024  Female           3200.0              700.0        70.0  urban
11  LP001027    Male           2500.0             1840.0       109.0  urban
12  LP001028  Female              NaN             8106.0         NaN  urban
13  LP001029    Male           1853.0             2840.0       114.0  urban
14  LP001030    Male           1299.0             1086.0        17.0   semi
15  LP001032    Male           4950.0                0.0       125.0   semi

In [47]:
Y

0       Y
1       N
2       Y
3     NaN
4       Y
5       Y
6       Y
7       N
8       Y
9       N
10      Y
11      Y
12      Y
13      N
14      Y
15      Y
Name: Loan_Status, dtype: object

In [39]:
# Split by rows for training and test datasets
from sklearn.model_selection import train_test_split
X_train, X_test, Y_train, Y_test =      \
train_test_split(X, Y, test_size=0.3, random_state=1234)